{
  "_name_or_path": "vinai/phobert-base",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "bao_dau_bung",
    "1": "bao_dau_dau",
    "2": "bao_ho",
    "3": "bao_met_moi",
    "4": "bao_sot",
    "5": "lo_lang_stress",
    "6": "other",
    "7": "tu_van_dinh_duong",
    "8": "tu_van_tap_luyen"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "bao_dau_bung": 0,
    "bao_dau_dau": 1,
    "bao_ho": 2,
    "bao_met_moi": 3,
    "bao_sot": 4,
    "lo_lang_stress": 5,
    "other": 6,
    "tu_van_dinh_duong": 7,
    "tu_van_tap_luyen": 8
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tokenizer_class": "PhobertTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.39.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
